# Partly auto-generated using `brew bundle --dump --describe`.

# Custom formulae
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "zwaldowski/tap"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Validate EPUB files, version 2.0 and later
brew "epubcheck"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Git extension for versioning large files
brew "git-lfs"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Plugin and runtime library for using protobuf with Swift
brew "swift-protobuf"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Play, record, convert, and stream audio and video
brew "zwaldowski/tap/ffmpeg-lite"

# API documentation browser and code snippet manager
cask "dash"
# Markdown slide presentation tool
cask "deckset"
# Compact variant of "San Francisco" by Apple
cask "font-sf-compact"
# Monospaced variant of "San Francisco" by Apple
cask "font-sf-mono"
# Sans-serif variant of "San Francisco" by Apple
cask "font-sf-pro"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Command-line tool for the App Store version of Kaleidoscope
cask "ksdiff"
# Multi-platform web browser
cask "microsoft-edge"
# Extract files and folders from package files, disk images, and archives
cask "pacifist"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Digital design and prototyping platform
cask "sketch"
# Git client focusing on power and productivity
cask "tower"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "webex-meetings"
# Video communication and virtual meeting platform
cask "zoom"

mas "1Blocker", id: 1365531024
mas "1Password 7", id: 1333542190
mas "Baking Soda", id: 1601151613
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 924726344
mas "Developer", id: 640199958
mas "Gifski", id: 1351639930
mas "Hush", id: 1544743900
mas "Kaleidoscope", id: 1575557335
mas "Keynote", id: 409183694
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parallels Desktop", id: 1085114709
mas "Patterns", id: 429449079
mas "Pixelmator Pro", id: 1289583905
mas "Playgrounds", id: 1496833156
mas "Poolsuite FM", id: 1514817810
mas "TestFlight", id: 899247664
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Tot", id: 1491071483
mas "Twitter", id: 1482454543
mas "Vinegar", id: 1591303229
mas "Xcode", id: 497799835
mas "xScope", id: 889428659
