# Partly auto-generated using `brew bundle --dump --describe`.

# Alternate versions of Casks
tap "homebrew/cask-versions"
# Custom formulae
tap "zwaldowski/tap"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Play, record, convert, and stream audio and video
brew "ffmpeg-lite"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Git extension for versioning large files
brew "git-lfs"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Plugin and runtime library for using protobuf with Swift
brew "swift-protobuf"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Download YouTube videos from the command-line
brew "youtube-dl"

cask "1password-beta"
cask "asset-catalog-tinkerer"
cask "dash"
cask "deckset"
cask "docker"
cask "gitup"
cask "kaleidoscope"
cask "microblog"
cask "microsoft-edge-beta"
cask "pacifist"
cask "paw"
cask "safari-technology-preview"
cask "sf-symbols"
cask "sketch"
cask "visual-studio-code"
cask "webex-meetings"
cask "zoomus"

mas "1Blocker", id: 1107421413
mas "CARROT Weather", id: 993487541
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 924726344
mas "Developer", id: 640199958
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Keynote", id: 409183694
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parallels Desktop", id: 1085114709
mas "Patterns", id: 429449079
mas "Pixelmator", id: 407963104
mas "Playgrounds", id: 1496833156
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Tot", id: 1491071483
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
mas "xScope", id: 889428659
