# Partly auto-generated using `brew bundle --dump --describe`.

# Custom formulae
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "peripheryapp/periphery"
tap "zwaldowski/tap"

# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Platform built on V8 to build network applications
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Convert audio and video
brew "zwaldowski/tap/ffmpeg-lite"
# Voice and text chat software
cask "discord"
# Compact variant of "San Francisco" by Apple
cask "font-sf-compact"
# Monospaced variant of "San Francisco" by Apple
cask "font-sf-mono"
# Sans-serif variant of "San Francisco" by Apple
cask "font-sf-pro"
# Web browser
cask "google-chrome-beta"
# Disassemble, decompile, and debug your applications
cask "hopper-disassembler"
# Extract files and folders from package files, disk images, and archives
cask "pacifist"
# A tool to identify unused code in Swift projects
cask "periphery"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Digital design and prototyping platform
cask "sketch"
# Git client focusing on power and productivity
cask "tower"
# Open-source code editor
cask "visual-studio-code"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Feature-rich command-line audio/video downloader
cask "yt-dlp"
# Video communication and virtual meeting platform
cask "zoom"

mas "1Blocker", id: 1365531024
mas "DaisyDisk", id: 411643860
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Gifski", id: 1351639930
mas "Hush", id: 1544743900
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Mela", id: 1568924476
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
mas "TestFlight", id: 899247664
mas "Tot", id: 1491071483
mas "Vinegar", id: 1591303229
mas "Wallaroo", id: 1630565980
mas "Xcode", id: 497799835
mas "xScope", id: 889428659
