tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "clang-format"
brew "cmake"
brew "ffmpeg"
brew "fish"
brew "graphicsmagick"
brew "libressl"
brew "node"
brew "protobuf"
brew "ruby-build"
brew "rbenv"
brew "swift-protobuf"
brew "swiftlint"
brew "youtube-dl"
cask "asset-catalog-tinkerer"
cask "coderunner"
cask "deckset"
cask "docker"
cask "firefox-beta"
cask "gitup"
cask "imageoptim"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "kaleidoscope"
cask "keybase"
cask "microblog"
cask "microsoft-edge-dev"
cask "pacifist"
cask "paw"
cask "safari-technology-preview"
cask "sf-symbols"
cask "sketch"
cask "sublime-text-dev"
cask "visual-studio-code"
cask "zoomus"
mas "1Blocker", id: 1107421413
mas "1Password 7", id: 1333542190
mas "CARROT Weather", id: 993487541
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 924726344
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "OmniGraffle", id: 1142578753
mas "Patterns", id: 429449079
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "ToothFairy", id: 1191449274
mas "Twitter", id: 1482454543
mas "xScope", id: 889428659
mas "xScope", id: 889428659
