tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
# Common open-source libraries and tools
brew "autoconf"
brew "gdbm"
brew "cmake"
brew "gettext"
brew "lame"
brew "libassuan"
brew "libressl"
brew "libgpg-error"
brew "libksba"
brew "libvo-aacenc"
brew "pkg-config"
brew "readline"
brew "xvid"
# Cocoa dependency manager
brew "carthage"
# Clang Format: LLVM-based C/ObjC code linter
brew "clang-format"
# FFMPEG: Swiss army knife for multimedia encoding
brew "ffmpeg"
# Fish: amazing autocomplete-based modern shell
brew "fish"
# Git: decentralized version control system
brew "git"
brew "git-lfs"
# GNUPG: pretty good privacy and encryption
brew "gnupg", args: ["without-libusb"]
brew "pinentry"
brew "pinentry-mac"
# mas: CLI for Mac App Store
brew "mas"
# Mobile Shell (mosh): a better remote shell
brew "mosh"
# Protobuf: Language-agnostic model generator
brew "protobuf", args: ["without-python@2"]
# rbenv: Ruby environment manager
brew "rbenv"
# ruby-build: Ruby installer extension for rbenv
brew "ruby-build", args: ["without-openssl"]
# SourceKitten: third-party library for interacting with Swift code
brew "sourcekitten"
# SwiftLint: third-party code quality linter for Swift
brew "swiftlint"
# Swift Protobuf: plugin to generate Swift code for Protobuf
brew "swift-protobuf"
# youtube-dl: Download videos from YouTube
brew "youtube-dl"
# CodeRunner: simple IDE for quick type-and-run programs
cask "coderunner"
#
cask "docker-edge"
# It's alive!
cask "firefox-beta"
# Open-source typefaces
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-lato"
cask "font-open-sans"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-ubuntu"
# GitUp: Blazingly fast, rational Git GUI
cask "gitup"
# Handbrake: encode video without the tears from ffmpeg
cask "handbrake"
# ImageAlpha: image compression tool
cask "imagealpha"
# ImageOptim: image optimizer
cask "imageoptim"
# iMazing: pull info from connected iOS devices
cask "imazing"
# Java; Good ol' GC'ed language runtime
cask "java" unless system "/usr/libexec/java_home --failfast"
# Kaleidoscope: bespoke file comparison
cask "kaleidoscope"
#
cask "keybase"
# MacDown: Markdown editor
cask "macdown"
# Pacifist: tried and true extraction tool for macOS packages
cask "pacifist"
# Paw: HTTP client
cask "paw"
# Purple Safari!
cask "safari-technology-preview"
# Sketch: vector drawing app
cask "sketch"
# Sublime Text; one-size-fits-all cross-platform text editor
cask "sublime-text-dev"
# Transmission: brilliant native Cocoa BitTorrent client
cask "transmission"
# Transmit: really good remote disk management
cask "transmit"
# VLC: play all sources of audio and video
cask "vlc"
#
cask "vmware-fusion"
mas "1Blocker", id: 1107421413
mas "1Password 7", id: 1333542190
mas "Apple Configurator 2", id: 1037126344
mas "Bear", id: 1091189122
mas "CARROT Weather", id: 993487541
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "iStat Menus", id: 1319778037
mas "OmniGraffle", id: 1142578753
mas "Patterns", id: 429449079
mas "PiPifier", id: 1160374471
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "xScope", id: 889428659
