tap "caskroom/fonts"
tap "caskroom/cask"
tap "caskroom/versions"

# Common open-source libraries and tools
brew "autoconf"
brew "gdbm"
brew "cmake"
brew "exiftool"
brew "gettext"
brew "lame"
brew "libassuan"
brew "libgpg-error"
brew "libksba"
brew "libvo-aacenc"
brew "ninja"
brew "pkg-config"
brew "pth"
brew "readline"
brew "xvid"
# AWS-CLI: Tools for accessing Amazon S3
brew "awscli"
# Cocoa dependency manager
brew "carthage"
# Fraunhofer AAC: proprietary, but efficient, AAC engine
brew "fdk-aac"
# FFMPEG: Swiss army knife for multimedia encoding
brew "ffmpeg"
# Fish: amazing autocomplete-based modern shell
brew "fish"
# Git: decentralized version control system
brew "git"
brew "git-lfs"
# GNUPG: pretty good privacy and encryption
brew "gnupg", args: ["without-libusb"]
brew "pinentry"
brew "pinentry-mac"
# mas: CLI for Mac App Store
brew "mas"
# Mobile Shell (mosh): a better remote shell
brew "mobile-shell"
#
brew "protobuf"
# rbenv: Ruby environment manager
brew "rbenv"
# ruby-build: Ruby installer extension for rbenv
brew "ruby-build"
# SourceKitten: third-party library for interacting with Swift code
brew "sourcekitten"
# SwiftLint: third-party code quality linter for Swift
brew "swiftlint"
# youtube-dl: Download videos from YouTube
brew "youtube-dl"

# CodeRunner: simple IDE for quick type-and-run programs
cask "coderunner"
#
cask "docker-edge"
# It's alive!
cask "firefox-beta"
# Open-source typefaces
cask "font-clear-sans"
cask "font-courier-prime"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-input"
cask "font-josefin-slab"
cask "font-lato"
cask "font-lobster-two"
cask "font-open-sans"
cask "font-roboto-mono"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-ubuntu"
# GitUp: Blazingly fast, rational Git GUI
cask "gitup"
# Google Chrome: Give your laptop five minutes battery, also use Flash
cask "google-chrome"
# Handbrake: encode video without the tears from ffmpeg
cask "handbrake"
# Hopper: amazing code introspection tool
cask "hopper-disassembler"
# ImageAlpha: image compression tool
cask "imagealpha"
# ImageOptim: image optimizer
cask "imageoptim"
# iMazing: pull info from connected iOS devices
cask "imazing"
# Java; Good ol' GC'ed language runtime
cask "java" unless system "/usr/libexec/java_home --failfast"
# Kaleidoscope: bespoke file comparison
cask "kaleidoscope"
#
cask "keybase"
# MacDown: Markdown editor
cask "macdown"
# OpenEmu: unified platform for playing old video games (BETA)
cask "openemu-experimental"
# Pacifist: tried and true extraction tool for Mac OS X packages
cask "pacifist"
# Paw: HTTP client
cask "paw"
# Quick Look plugins
cask "provisioning"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "quicklook-json"
# SelfControl: app to block procrastination and social networking sites
cask "selfcontrol"
# Sketch: vector drawing app
cask "sketch"
# Skype: ubiquitous video chat app
cask "skype"
# Subler: audiovisual metadata editor and remuxer
cask "subler"
# Sublime Text; one-size-fits-all cross-platform text editor
cask "sublime-text-dev"
# Transmission: brilliant native Cocoa BitTorrent client
cask "transmission"
# Transmit: really good remote disk management
cask "transmit"
#
cask "twitch"
# VLC: play all sources of audio and video
cask "vlc"
#
cask "vmware-fusion"

mas "1Blocker", id: 1107421413
mas "1Password", id: 443987910
mas "Apple Configurator 2", id: 1037126344
mas "Bear", id: 1091189122
mas "CARROT Weather", id: 993487541
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "Drop", id: 1173932628
mas "Mousepose", id: 405904955
mas "Noizio", id: 928871589
mas "OmniGraffle", id: 1142578753
mas "PaintCode", id: 808809998
mas "Patterns", id: 429449079
mas "PiPifier", id: 1160374471
mas "Pixelmator", id: 407963104
mas "Screeny", id: 440991524
mas "Slack", id: 803453959
mas "Soulver", id: 413965349
mas "Squash", id: 1152443474
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 557168941
mas "Twitter", id: 409789998
mas "Veertu", id: 1024069033
mas "xScope", id: 889428659
